app/controllers/api/users_controller.rb

SELECT "users".* FROM "users"
SELECT COUNT(*) FROM "users"
SELECT "users".* FROM "users" LIMIT ? OFFSET ?  [["LIMIT", 3], ["OFFSET", 0]]
---
	def index
		all_users = User.all
		total_count = all_users.count
		page = params[:page]||User::PAGE
		per_page = params[:per_page]||User::PER_PAGE
		users = all_users.paginate(page:page, per_page: per_page)
		if users.present?
			mod = all_users.length % per_page.to_i
			pages = all_users.length / per_page.to_i
			pages+=1 if mod>0
		else
			pages = 0
		end

		render json:{users: ActiveModel::SerializableResource.new(users,each_serializer:UsersSerializer).as_json,
		meta:{
			pagination:{
				current_page: users.current_page,
				total_pages: pages.present? ? pages: "",
				per_page: per_page,
				total_count: total_count

INSERT INTO "users" ("firstName", "lastName", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["firstName", "marie_and_issac"], ["lastName", "curie"], ["email", "marie7@gmail.com"], ["created_at", "2020-09-29 18:04:48.839260"], ["updated_at", "2020-09-29 18:04:48.839260"]]
---
	def create
		user = User.create!(user_params)

UPDATE "users" SET "lastName" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["lastName", "updated_last_name2"], ["updated_at", "2020-09-29 18:05:23.648420"], ["id", 3]]
---
	def update
		@user.update!(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
	def get_user
		@user  = User.find(params[:id])