app/controllers/api/users_controller.rb

	def create
		user = User.create!(user_params)
---
INSERT INTO "users" ("firstName", "lastName", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["firstName", "test1"], ["lastName", "test2"], ["email", "test3@gmail.com"], ["created_at", "2020-09-29 17:30:59.609726"], ["updated_at", "2020-09-29 17:30:59.609726"]]

	def get_user
		@user  = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE (email like 'mar%' OR firstName like 'mar%' OR lastName like 'mar%')